reference/openfoam/incompressible_lid_driven_cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   5000;
purgeWrite      0;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   10;

runTimeModifiable true;

functions
{
    probesAll
    {
        #include "probes_all.cfg"
    }
}

