reference/openfoam/incompressible_lid_driven_cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    lid
    {
        type            movingWallVelocity;
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

