reference/openfoam/incompressible_lid_driven_cavity/system/probes_all.cfg
type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

fields (U p);

probeLocations
(
    (0.025 0.025 0)
    (0.07500000000000001 0.025 0)
    (0.125 0.025 0)
    (0.175 0.025 0)
    (0.225 0.025 0)
    (0.275 0.025 0)
    (0.325 0.025 0)
    (0.375 0.025 0)
    (0.425 0.025 0)
    (0.475 0.025 0)
    (0.525 0.025 0)
    (0.5750000000000001 0.025 0)
    (0.625 0.025 0)
    (0.675 0.025 0)
    (0.7250000000000001 0.025 0)
    (0.775 0.025 0)
    (0.8250000000000001 0.025 0)
    (0.875 0.025 0)
    (0.925 0.025 0)
    (0.9750000000000001 0.025 0)
    (0.025 0.07500000000000001 0)
    (0.07500000000000001 0.07500000000000001 0)
    (0.125 0.07500000000000001 0)
    (0.175 0.07500000000000001 0)
    (0.225 0.07500000000000001 0)
    (0.275 0.07500000000000001 0)
    (0.325 0.07500000000000001 0)
    (0.375 0.07500000000000001 0)
    (0.425 0.07500000000000001 0)
    (0.475 0.07500000000000001 0)
    (0.525 0.07500000000000001 0)
    (0.5750000000000001 0.07500000000000001 0)
    (0.625 0.07500000000000001 0)
    (0.675 0.07500000000000001 0)
    (0.7250000000000001 0.07500000000000001 0)
    (0.775 0.07500000000000001 0)
    (0.8250000000000001 0.07500000000000001 0)
    (0.875 0.07500000000000001 0)
    (0.925 0.07500000000000001 0)
    (0.9750000000000001 0.07500000000000001 0)
    (0.025 0.125 0)
    (0.07500000000000001 0.125 0)
    (0.125 0.125 0)
    (0.175 0.125 0)
    (0.225 0.125 0)
    (0.275 0.125 0)
    (0.325 0.125 0)
    (0.375 0.125 0)
    (0.425 0.125 0)
    (0.475 0.125 0)
    (0.525 0.125 0)
    (0.5750000000000001 0.125 0)
    (0.625 0.125 0)
    (0.675 0.125 0)
    (0.7250000000000001 0.125 0)
    (0.775 0.125 0)
    (0.8250000000000001 0.125 0)
    (0.875 0.125 0)
    (0.925 0.125 0)
    (0.9750000000000001 0.125 0)
    (0.025 0.175 0)
    (0.07500000000000001 0.175 0)
    (0.125 0.175 0)
    (0.175 0.175 0)
    (0.225 0.175 0)
    (0.275 0.175 0)
    (0.325 0.175 0)
    (0.375 0.175 0)
    (0.425 0.175 0)
    (0.475 0.175 0)
    (0.525 0.175 0)
    (0.5750000000000001 0.175 0)
    (0.625 0.175 0)
    (0.675 0.175 0)
    (0.7250000000000001 0.175 0)
    (0.775 0.175 0)
    (0.8250000000000001 0.175 0)
    (0.875 0.175 0)
    (0.925 0.175 0)
    (0.9750000000000001 0.175 0)
    (0.025 0.225 0)
    (0.07500000000000001 0.225 0)
    (0.125 0.225 0)
    (0.175 0.225 0)
    (0.225 0.225 0)
    (0.275 0.225 0)
    (0.325 0.225 0)
    (0.375 0.225 0)
    (0.425 0.225 0)
    (0.475 0.225 0)
    (0.525 0.225 0)
    (0.5750000000000001 0.225 0)
    (0.625 0.225 0)
    (0.675 0.225 0)
    (0.7250000000000001 0.225 0)
    (0.775 0.225 0)
    (0.8250000000000001 0.225 0)
    (0.875 0.225 0)
    (0.925 0.225 0)
...
);
